app/controllers/api/v1/restaurants_controller.rb

      def index
        @restaurants = Restaurant.all
---
SELECT "restaurants".* FROM "restaurants"

      def create
        @restaurant = Restaurant.new(restaurant_params)

        if @restaurant.save
---
INSERT INTO "restaurants" ("name", "cuisine", "address", "website", "latitude", "longitude", "user_added", "created_at", "updated_at") VALUES ('Loaf''d', 'Restaurant', 'The Plaza, Main St, Townparks, Swords, Co. Dublin, K67 AX62, Ireland', 'https://loafd.ie/', 53.4568084, -6.2206494, FALSE, '2025-11-10 00:21:34.427760', '2025-11-10 00:21:34.427760') RETURNING "id"

      def destroy
        @restaurant.destroy
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = 12

      def set_restaurant
        @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 12 LIMIT 1